Tekla.Structures.Dialog.FormBase.WriteToDataStorage(Tekla.Structures.DialogInternal.DialogDataStorageBase)
Writes the values from the shown dialog to the given data storage.
dataStorage: The data storage to write to.